## production: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 15 to add, 14 to change, 12 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                          NAME                                                          |
|----------|------------------------------------------------------------------------------------------------------------------------|
| add      | `module.notify_slack_critical.module.lambda.local_file.archive_plan[0]`                                                |
|          | `module.notify_slack_ok.module.lambda.local_file.archive_plan[0]`                                                      |
|          | `module.notify_slack_warning.module.lambda.local_file.archive_plan[0]`                                                 |
| update   | `aws_kms_key.notification-canada-ca`                                                                                   |
|          | `aws_sqs_queue.eks_notification_canada_ca_email_high_queue`                                                            |
|          | `aws_sqs_queue.eks_notification_canada_ca_sms_high_queue`                                                              |
|          | `aws_sqs_queue.eks_notification_canada_cadelivery_receipts`                                                            |
|          | `aws_sqs_queue.notify_internal_tasks_queue`                                                                            |
|          | `module.notify_slack_critical.module.lambda.aws_iam_policy.additional_json[0]`                                         |
|          | `module.notify_slack_critical.module.lambda.aws_iam_role.lambda[0]`                                                    |
|          | `module.notify_slack_critical.module.lambda.aws_lambda_function.this[0]`                                               |
|          | `module.notify_slack_ok.module.lambda.aws_iam_policy.additional_json[0]`                                               |
|          | `module.notify_slack_ok.module.lambda.aws_iam_role.lambda[0]`                                                          |
|          | `module.notify_slack_ok.module.lambda.aws_lambda_function.this[0]`                                                     |
|          | `module.notify_slack_warning.module.lambda.aws_iam_policy.additional_json[0]`                                          |
|          | `module.notify_slack_warning.module.lambda.aws_iam_role.lambda[0]`                                                     |
|          | `module.notify_slack_warning.module.lambda.aws_lambda_function.this[0]`                                                |
| recreate | `module.notify_slack_critical.aws_sns_topic_subscription.sns_notify_slack[0]`                                          |
|          | `module.notify_slack_ok.aws_sns_topic_subscription.sns_notify_slack[0]`                                                |
|          | `module.notify_slack_warning.aws_sns_topic_subscription.sns_notify_slack[0]`                                           |
|          | `module.notify_slack_critical.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`   |
|          | `module.notify_slack_critical.module.lambda.aws_lambda_permission.unqualified_alias_triggers[&quot;AllowExecutionFromSNS&quot;]` |
|          | `module.notify_slack_critical.module.lambda.null_resource.archive[0]`                                                  |
|          | `module.notify_slack_ok.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`         |
|          | `module.notify_slack_ok.module.lambda.aws_lambda_permission.unqualified_alias_triggers[&quot;AllowExecutionFromSNS&quot;]`       |
|          | `module.notify_slack_ok.module.lambda.null_resource.archive[0]`                                                        |
|          | `module.notify_slack_warning.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`    |
|          | `module.notify_slack_warning.module.lambda.aws_lambda_permission.unqualified_alias_triggers[&quot;AllowExecutionFromSNS&quot;]`  |
|          | `module.notify_slack_warning.module.lambda.null_resource.archive[0]`                                                   |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/16753331578).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
14:42:32.987 STDOUT terraform:   + create
14:42:32.987 STDOUT terraform:   ~ update in-place
14:42:32.987 STDOUT terraform: -/+ destroy and then create replacement
14:42:32.987 STDOUT terraform:  <= read (data resources)
14:42:32.987 STDOUT terraform: Terraform will perform the following actions:
14:42:32.987 STDOUT terraform:   # aws_kms_key.notification-canada-ca will be updated in-place
14:42:32.987 STDOUT terraform:   ~ resource "aws_kms_key" "notification-canada-ca" {
14:42:32.987 STDOUT terraform:         id                                 = "e9461cc1-4524-4b50-b6e6-583013da2904"
14:42:32.987 STDOUT terraform:       ~ policy                             = jsonencode(
14:42:32.987 STDOUT terraform:           ~ {
14:42:32.987 STDOUT terraform:               ~ Statement = [
14:42:32.987 STDOUT terraform:                     # (3 unchanged elements hidden)
14:42:32.987 STDOUT terraform:                     {
14:42:32.987 STDOUT terraform:                         Action    = [
14:42:32.987 STDOUT terraform:                             "kms:GenerateDataKey*",
14:42:32.987 STDOUT terraform:                             "kms:Decrypt",
14:42:32.987 STDOUT terraform:                         ]
14:42:32.987 STDOUT terraform:                         Effect    = "Allow"
14:42:32.987 STDOUT terraform:                         Principal = {
14:42:32.987 STDOUT terraform:                             Service = "ses.amazonaws.com"
14:42:32.987 STDOUT terraform:                         }
14:42:32.987 STDOUT terraform:                         Resource  = "*"
14:42:32.987 STDOUT terraform:                     },
14:42:32.987 STDOUT terraform:                   + {
14:42:32.987 STDOUT terraform:                       + Action    = [
14:42:32.987 STDOUT terraform:                           + "kms:GenerateDataKey",
14:42:32.987 STDOUT terraform:                           + "kms:Decrypt",
14:42:32.987 STDOUT terraform:                         ]
14:42:32.987 STDOUT terraform:                       + Condition = {
14:42:32.987 STDOUT terraform:                           + StringEquals = {
14:42:32.987 STDOUT terraform:                               + "aws:SourceAccount" = "296255494825"
14:42:32.987 STDOUT terraform:                             }
14:42:32.988 STDOUT terraform:                         }
14:42:32.988 STDOUT terraform:                       + Effect    = "Allow"
14:42:32.988 STDOUT terraform:                       + Principal = {
14:42:32.988 STDOUT terraform:                           + Service = "budgets.amazonaws.com"
14:42:32.988 STDOUT terraform:                         }
14:42:32.988 STDOUT terraform:                       + Resource  = "*"
14:42:32.988 STDOUT terraform:                       + Sid       = "AllowBudgetsServiceToUseKey"
14:42:32.988 STDOUT terraform:                     },
14:42:32.988 STDOUT terraform:                 ]
14:42:32.988 STDOUT terraform:                 # (1 unchanged attribute hidden)
14:42:32.988 STDOUT terraform:             }
14:42:32.988 STDOUT terraform:         )
14:42:32.988 STDOUT terraform:         tags                               = {
14:42:32.988 STDOUT terraform:             "CostCenter" = "notification-canada-ca-production"
14:42:32.988 STDOUT terraform:             "Name"       = "notification-canada-ca"
14:42:32.988 STDOUT terraform:         }
14:42:32.988 STDOUT terraform:         # (13 unchanged attributes hidden)
14:42:32.988 STDOUT terraform:     }
14:42:32.988 STDOUT terraform:   # aws_sqs_queue.eks_notification_canada_ca_email_high_queue will be updated in-place
14:42:32.988 STDOUT terraform:   ~ resource "aws_sqs_queue" "eks_notification_canada_ca_email_high_queue" {
14:42:32.988 STDOUT terraform:         id                                = "https://sqs.ca-central-1.amazonaws.com/296255494825/eks-notification-canada-casend-email-high"
14:42:32.988 STDOUT terraform:       ~ max_message_size                  = 1048576 -> 262144
14:42:32.988 STDOUT terraform:         name                              = "eks-notification-canada-casend-email-high"
14:42:32.988 STDOUT terraform:         tags                              = {}
14:42:32.988 STDOUT terraform:         # (18 unchanged attributes hidden)
14:42:32.989 STDOUT terraform:     }
14:42:32.989 STDOUT terraform:   # aws_sqs_queue.eks_notification_canada_ca_sms_high_queue will be updated in-place
14:42:32.989 STDOUT terraform:   ~ resource "aws_sqs_queue" "eks_notification_canada_ca_sms_high_queue" {
14:42:32.989 STDOUT terraform:         id                                = "https://sqs.ca-central-1.amazonaws.com/296255494825/eks-notification-canada-casend-sms-high"
14:42:32.989 STDOUT terraform:       ~ max_message_size                  = 1048576 -> 262144
14:42:32.989 STDOUT terraform:         name                              = "eks-notification-canada-casend-sms-high"
14:42:32.989 STDOUT terraform:         tags                              = {}
14:42:32.989 STDOUT terraform:         # (18 unchanged attributes hidden)
14:42:32.989 STDOUT terraform:     }
14:42:32.989 STDOUT terraform:   # aws_sqs_queue.eks_notification_canada_cadelivery_receipts will be updated in-place
14:42:32.989 STDOUT terraform:   ~ resource "aws_sqs_queue" "eks_notification_canada_cadelivery_receipts" {
14:42:32.989 STDOUT terraform:         id                                = "https://sqs.ca-central-1.amazonaws.com/296255494825/eks-notification-canada-cadelivery-receipts"
14:42:32.989 STDOUT terraform:       ~ max_message_size                  = 1048576 -> 262144
14:42:32.989 STDOUT terraform:         name                              = "eks-notification-canada-cadelivery-receipts"
14:42:32.990 STDOUT terraform:         tags                              = {
14:42:32.990 STDOUT terraform:             "Environment" = "production"
14:42:32.990 STDOUT terraform:         }
14:42:32.991 STDOUT terraform:         # (18 unchanged attributes hidden)
14:42:32.991 STDOUT terraform:     }
14:42:32.991 STDOUT terraform:   # aws_sqs_queue.notify_internal_tasks_queue will be updated in-place
14:42:32.991 STDOUT terraform:   ~ resource "aws_sqs_queue" "notify_internal_tasks_queue" {
14:42:32.991 STDOUT terraform:         id                                = "https://sqs.ca-central-1.amazonaws.com/296255494825/eks-notification-canada-canotify-internal-tasks"
14:42:32.991 STDOUT terraform:       ~ max_message_size                  = 1048576 -> 262144
14:42:32.991 STDOUT terraform:         name                              = "eks-notification-canada-canotify-internal-tasks"
14:42:32.992 STDOUT terraform:         tags                              = {}
14:42:32.992 STDOUT terraform:         # (18 unchanged attributes hidden)
14:42:32.992 STDOUT terraform:     }
14:42:32.992 STDOUT terraform:   # module.notify_slack_critical.data.aws_caller_identity.current will be read during apply
14:42:32.992 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:32.992 STDOUT terraform:  <= data "aws_caller_identity" "current" {
14:42:32.992 STDOUT terraform:       + account_id = (known after apply)
14:42:32.992 STDOUT terraform:       + arn        = (known after apply)
14:42:32.992 STDOUT terraform:       + id         = (known after apply)
14:42:32.993 STDOUT terraform:       + user_id    = (known after apply)
14:42:32.993 STDOUT terraform:     }
14:42:32.993 STDOUT terraform:   # module.notify_slack_critical.data.aws_iam_policy_document.lambda[0] will be read during apply
14:42:32.993 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:32.993 STDOUT terraform:  <= data "aws_iam_policy_document" "lambda" {
14:42:32.993 STDOUT terraform:       + id            = (known after apply)
14:42:32.993 STDOUT terraform:       + json          = (known after apply)
14:42:32.993 STDOUT terraform:       + minified_json = (known after apply)
14:42:32.993 STDOUT terraform:       + statement {
14:42:32.993 STDOUT terraform:           + actions   = [
14:42:32.994 STDOUT terraform:               + "logs:CreateLogStream",
14:42:32.994 STDOUT terraform:               + "logs:PutLogEvents",
14:42:32.994 STDOUT terraform:             ]
14:42:32.994 STDOUT terraform:           + effect    = "Allow"
14:42:32.994 STDOUT terraform:           + resources = [
14:42:32.994 STDOUT terraform:               + "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/notify-slack-critical:*",
14:42:32.994 STDOUT terraform:             ]
14:42:32.994 STDOUT terraform:           + sid       = "AllowWriteToCloudwatchLogs"
14:42:32.994 STDOUT terraform:         }
14:42:32.994 STDOUT terraform:     }
14:42:32.994 STDOUT terraform:   # module.notify_slack_critical.data.aws_partition.current will be read during apply
14:42:32.994 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:32.994 STDOUT terraform:  <= data "aws_partition" "current" {
14:42:32.994 STDOUT terraform:       + dns_suffix         = (known after apply)
14:42:32.994 STDOUT terraform:       + id                 = (known after apply)
14:42:32.994 STDOUT terraform:       + partition          = (known after apply)
14:42:32.995 STDOUT terraform:       + reverse_dns_prefix = (known after apply)
14:42:32.995 STDOUT terraform:     }
14:42:32.995 STDOUT terraform:   # module.notify_slack_critical.data.aws_region.current will be read during apply
14:42:32.995 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:32.995 STDOUT terraform:  <= data "aws_region" "current" {
14:42:32.995 STDOUT terraform:       + description = (known after apply)
14:42:32.995 STDOUT terraform:       + endpoint    = (known after apply)
14:42:32.995 STDOUT terraform:       + id          = (known after apply)
14:42:32.995 STDOUT terraform:       + name        = (known after apply)
14:42:32.995 STDOUT terraform:     }
14:42:32.995 STDOUT terraform:   # module.notify_slack_critical.aws_sns_topic_subscription.sns_notify_slack[0] must be replaced
14:42:32.996 STDOUT terraform: -/+ resource "aws_sns_topic_subscription" "sns_notify_slack" {
14:42:32.996 STDOUT terraform:       ~ arn                             = "arn:aws:sns:ca-central-1:296255494825:alert-critical:58d3b83e-5473-486b-9674-44838c2c6789" -> (known after apply)
14:42:32.996 STDOUT terraform:       ~ confirmation_was_authenticated  = true -> (known after apply)
14:42:32.996 STDOUT terraform:       + filter_policy_scope             = (known after apply)
14:42:32.997 STDOUT terraform:       ~ id                              = "arn:aws:sns:ca-central-1:296255494825:alert-critical:58d3b83e-5473-486b-9674-44838c2c6789" -> (known after apply)
14:42:32.997 STDOUT terraform:       ~ owner_id                        = "296255494825" -> (known after apply)
14:42:32.997 STDOUT terraform:       ~ pending_confirmation            = false -> (known after apply)
14:42:32.997 STDOUT terraform:       ~ topic_arn                       = "arn:aws:sns:ca-central-1:296255494825:alert-critical" -> (known after apply) # forces replacement
14:42:32.997 STDOUT terraform:         # (10 unchanged attributes hidden)
14:42:32.997 STDOUT terraform:     }
14:42:32.997 STDOUT terraform:   # module.notify_slack_ok.data.aws_caller_identity.current will be read during apply
14:42:32.997 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:32.997 STDOUT terraform:  <= data "aws_caller_identity" "current" {
14:42:32.997 STDOUT terraform:       + account_id = (known after apply)
14:42:32.997 STDOUT terraform:       + arn        = (known after apply)
14:42:32.997 STDOUT terraform:       + id         = (known after apply)
14:42:32.997 STDOUT terraform:       + user_id    = (known after apply)
14:42:32.997 STDOUT terraform:     }
14:42:32.997 STDOUT terraform:   # module.notify_slack_ok.data.aws_iam_policy_document.lambda[0] will be read during apply
14:42:32.997 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:32.997 STDOUT terraform:  <= data "aws_iam_policy_document" "lambda" {
14:42:32.997 STDOUT terraform:       + id            = (known after apply)
14:42:32.997 STDOUT terraform:       + json          = (known after apply)
14:42:32.997 STDOUT terraform:       + minified_json = (known after apply)
14:42:32.998 STDOUT terraform:       + statement {
14:42:32.998 STDOUT terraform:           + actions   = [
14:42:32.998 STDOUT terraform:               + "logs:CreateLogStream",
14:42:32.998 STDOUT terraform:               + "logs:PutLogEvents",
14:42:32.998 STDOUT terraform:             ]
14:42:32.998 STDOUT terraform:           + effect    = "Allow"
14:42:32.998 STDOUT terraform:           + resources = [
14:42:32.998 STDOUT terraform:               + "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/notify-slack-ok:*",
14:42:32.998 STDOUT terraform:             ]
14:42:32.998 STDOUT terraform:           + sid       = "AllowWriteToCloudwatchLogs"
14:42:32.998 STDOUT terraform:         }
14:42:32.998 STDOUT terraform:     }
14:42:32.998 STDOUT terraform:   # module.notify_slack_ok.data.aws_partition.current will be read during apply
14:42:32.998 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:32.998 STDOUT terraform:  <= data "aws_partition" "current" {
14:42:32.998 STDOUT terraform:       + dns_suffix         = (known after apply)
14:42:32.998 STDOUT terraform:       + id                 = (known after apply)
14:42:32.998 STDOUT terraform:       + partition          = (known after apply)
14:42:32.998 STDOUT terraform:       + reverse_dns_prefix = (known after apply)
14:42:32.998 STDOUT terraform:     }
14:42:32.998 STDOUT terraform:   # module.notify_slack_ok.data.aws_region.current will be read during apply
14:42:32.998 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:32.998 STDOUT terraform:  <= data "aws_region" "current" {
14:42:32.998 STDOUT terraform:       + description = (known after apply)
14:42:32.998 STDOUT terraform:       + endpoint    = (known after apply)
14:42:32.998 STDOUT terraform:       + id          = (known after apply)
14:42:32.998 STDOUT terraform:       + name        = (known after apply)
14:42:32.998 STDOUT terraform:     }
14:42:32.998 STDOUT terraform:   # module.notify_slack_ok.aws_sns_topic_subscription.sns_notify_slack[0] must be replaced
14:42:32.999 STDOUT terraform: -/+ resource "aws_sns_topic_subscription" "sns_notify_slack" {
14:42:32.999 STDOUT terraform:       ~ arn                             = "arn:aws:sns:ca-central-1:296255494825:alert-ok:fc2830a5-06cd-48e3-a518-9e903370fa39" -> (known after apply)
14:42:32.999 STDOUT terraform:       ~ confirmation_was_authenticated  = true -> (known after apply)
14:42:32.999 STDOUT terraform:       + filter_policy_scope             = (known after apply)
14:42:32.999 STDOUT terraform:       ~ id                              = "arn:aws:sns:ca-central-1:296255494825:alert-ok:fc2830a5-06cd-48e3-a518-9e903370fa39" -> (known after apply)
14:42:33.003 STDOUT terraform:       ~ owner_id                        = "296255494825" -> (known after apply)
14:42:33.004 STDOUT terraform:       ~ pending_confirmation            = false -> (known after apply)
14:42:33.004 STDOUT terraform:       ~ topic_arn                       = "arn:aws:sns:ca-central-1:296255494825:alert-ok" -> (known after apply) # forces replacement
14:42:33.004 STDOUT terraform:         # (10 unchanged attributes hidden)
14:42:33.004 STDOUT terraform:     }
14:42:33.004 STDOUT terraform:   # module.notify_slack_warning.data.aws_caller_identity.current will be read during apply
14:42:33.004 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:33.004 STDOUT terraform:  <= data "aws_caller_identity" "current" {
14:42:33.004 STDOUT terraform:       + account_id = (known after apply)
14:42:33.004 STDOUT terraform:       + arn        = (known after apply)
14:42:33.004 STDOUT terraform:       + id         = (known after apply)
14:42:33.004 STDOUT terraform:       + user_id    = (known after apply)
14:42:33.004 STDOUT terraform:     }
14:42:33.004 STDOUT terraform:   # module.notify_slack_warning.data.aws_iam_policy_document.lambda[0] will be read during apply
14:42:33.004 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:33.004 STDOUT terraform:  <= data "aws_iam_policy_document" "lambda" {
14:42:33.004 STDOUT terraform:       + id            = (known after apply)
14:42:33.004 STDOUT terraform:       + json          = (known after apply)
14:42:33.004 STDOUT terraform:       + minified_json = (known after apply)
14:42:33.004 STDOUT terraform:       + statement {
14:42:33.004 STDOUT terraform:           + actions   = [
14:42:33.004 STDOUT terraform:               + "logs:CreateLogStream",
14:42:33.004 STDOUT terraform:               + "logs:PutLogEvents",
14:42:33.004 STDOUT terraform:             ]
14:42:33.004 STDOUT terraform:           + effect    = "Allow"
14:42:33.004 STDOUT terraform:           + resources = [
14:42:33.005 STDOUT terraform:               + "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/notify-slack-warning:*",
14:42:33.005 STDOUT terraform:             ]
14:42:33.005 STDOUT terraform:           + sid       = "AllowWriteToCloudwatchLogs"
14:42:33.005 STDOUT terraform:         }
14:42:33.005 STDOUT terraform:     }
14:42:33.005 STDOUT terraform:   # module.notify_slack_warning.data.aws_partition.current will be read during apply
14:42:33.005 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:33.005 STDOUT terraform:  <= data "aws_partition" "current" {
14:42:33.005 STDOUT terraform:       + dns_suffix         = (known after apply)
14:42:33.005 STDOUT terraform:       + id                 = (known after apply)
14:42:33.005 STDOUT terraform:       + partition          = (known after apply)
14:42:33.005 STDOUT terraform:       + reverse_dns_prefix = (known after apply)
14:42:33.005 STDOUT terraform:     }
14:42:33.005 STDOUT terraform:   # module.notify_slack_warning.data.aws_region.current will be read during apply
14:42:33.005 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:33.005 STDOUT terraform:  <= data "aws_region" "current" {
14:42:33.005 STDOUT terraform:       + description = (known after apply)
14:42:33.005 STDOUT terraform:       + endpoint    = (known after apply)
14:42:33.005 STDOUT terraform:       + id          = (known after apply)
14:42:33.005 STDOUT terraform:       + name        = (known after apply)
14:42:33.005 STDOUT terraform:     }
14:42:33.005 STDOUT terraform:   # module.notify_slack_warning.aws_sns_topic_subscription.sns_notify_slack[0] must be replaced
14:42:33.005 STDOUT terraform: -/+ resource "aws_sns_topic_subscription" "sns_notify_slack" {
14:42:33.005 STDOUT terraform:       ~ arn                             = "arn:aws:sns:ca-central-1:296255494825:alert-warning:cb4eb12a-e447-4891-8dfb-f844a1c6d97a" -> (known after apply)
14:42:33.006 STDOUT terraform:       ~ confirmation_was_authenticated  = true -> (known after apply)
14:42:33.006 STDOUT terraform:       + filter_policy_scope             = (known after apply)
14:42:33.006 STDOUT terraform:       ~ id                              = "arn:aws:sns:ca-central-1:296255494825:alert-warning:cb4eb12a-e447-4891-8dfb-f844a1c6d97a" -> (known after apply)
14:42:33.006 STDOUT terraform:       ~ owner_id                        = "296255494825" -> (known after apply)
14:42:33.006 STDOUT terraform:       ~ pending_confirmation            = false -> (known after apply)
14:42:33.006 STDOUT terraform:       ~ topic_arn                       = "arn:aws:sns:ca-central-1:296255494825:alert-warning" -> (known after apply) # forces replacement
14:42:33.006 STDOUT terraform:         # (10 unchanged attributes hidden)
14:42:33.006 STDOUT terraform:     }
14:42:33.006 STDOUT terraform:   # module.notify_slack_critical.module.lambda.data.aws_caller_identity.current will be read during apply
14:42:33.006 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:33.006 STDOUT terraform:  <= data "aws_caller_identity" "current" {
14:42:33.006 STDOUT terraform:       + account_id = (known after apply)
14:42:33.006 STDOUT terraform:       + arn        = (known after apply)
14:42:33.006 STDOUT terraform:       + id         = (known after apply)
14:42:33.006 STDOUT terraform:       + user_id    = (known after apply)
14:42:33.008 STDOUT terraform:     }
14:42:33.008 STDOUT terraform:   # module.notify_slack_critical.module.lambda.data.aws_cloudwatch_log_group.lambda[0] will be read during apply
14:42:33.008 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:33.008 STDOUT terraform:  <= data "aws_cloudwatch_log_group" "lambda" {
14:42:33.008 STDOUT terraform:       + arn               = (known after apply)
14:42:33.009 STDOUT terraform:       + creation_time     = (known after apply)
14:42:33.009 STDOUT terraform:       + id                = (known after apply)
14:42:33.009 STDOUT terraform:       + kms_key_id        = (known after apply)
14:42:33.009 STDOUT terraform:       + log_group_class   = (known after apply)
14:42:33.009 STDOUT terraform:       + name              = "/aws/lambda/notify-slack-critical"
14:42:33.009 STDOUT terraform:       + retention_in_days = (known after apply)
14:42:33.009 STDOUT terraform:       + tags              = (known after apply)
14:42:33.009 STDOUT terraform:     }
14:42:33.009 STDOUT terraform:   # module.notify_slack_critical.module.lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
14:42:33.009 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:33.009 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role" {
14:42:33.009 STDOUT terraform:       + id            = (known after apply)
14:42:33.009 STDOUT terraform:       + json          = (known after apply)
14:42:33.009 STDOUT terraform:       + minified_json = (known after apply)
14:42:33.009 STDOUT terraform:       + statement {
14:42:33.009 STDOUT terraform:           + actions = [
14:42:33.009 STDOUT terraform:               + "sts:AssumeRole",
14:42:33.009 STDOUT terraform:             ]
14:42:33.009 STDOUT terraform:           + effect  = "Allow"
14:42:33.009 STDOUT terraform:           + principals {
14:42:33.009 STDOUT terraform:               + identifiers = [
14:42:33.009 STDOUT terraform:                   + "lambda.amazonaws.com",
14:42:33.009 STDOUT terraform:                 ]
14:42:33.009 STDOUT terraform:               + type        = "Service"
14:42:33.009 STDOUT terraform:             }
14:42:33.009 STDOUT terraform:         }
14:42:33.009 STDOUT terraform:     }
14:42:33.009 STDOUT terraform:   # module.notify_slack_critical.module.lambda.data.aws_partition.current will be read during apply
14:42:33.009 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:33.010 STDOUT terraform:  <= data "aws_partition" "current" {
14:42:33.010 STDOUT terraform:       + dns_suffix         = (known after apply)
14:42:33.010 STDOUT terraform:       + id                 = (known after apply)
14:42:33.010 STDOUT terraform:       + partition          = (known after apply)
14:42:33.010 STDOUT terraform:       + reverse_dns_prefix = (known after apply)
14:42:33.010 STDOUT terraform:     }
14:42:33.010 STDOUT terraform:   # module.notify_slack_critical.module.lambda.data.aws_region.current will be read during apply
14:42:33.010 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:33.010 STDOUT terraform:  <= data "aws_region" "current" {
14:42:33.010 STDOUT terraform:       + description = (known after apply)
14:42:33.010 STDOUT terraform:       + endpoint    = (known after apply)
14:42:33.010 STDOUT terraform:       + id          = (known after apply)
14:42:33.010 STDOUT terraform:       + name        = (known after apply)
14:42:33.010 STDOUT terraform:     }
14:42:33.010 STDOUT terraform:   # module.notify_slack_critical.module.lambda.data.external.archive_prepare[0] will be read during apply
14:42:33.010 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:42:33.010 STDOUT terraform:  <= data "external" "archive_prepare" {
14:42:33.010 STDOUT terraform:       + id      = (known after apply)
14:42:33.010 STDOUT terraform:       + program = [
14:42:33.010 STDOUT terraform:           + "python3",
14:42:33.010 STDOUT terraform:           + ".terraform/modules/notify_slack_critical.lambda/package.py",
14:42:33.010 STDOUT terraform:           + "prepare",
14:42:33.010 STDOUT terraform:         ]
14:42:33.010 STDOUT terraform:       + query   = {
14:42:33.010 STDOUT terraform:           + "artifacts_dir"            = "builds"
14:42:33.010 STDOUT terraform:           + "docker"                   = null
14:42:33.010 STDOUT terraform:           + "hash_extra"               = null
14:42:33.010 STDOUT terraform:           + "hash_extra_paths"         = jsonencode([])
14:42:33.010 STDOUT terraform:           + "paths"                    = jsonencode(
14:42:33.011 STDOUT terraform:                 {
14:42:33.011 STDOUT terraform:                   + cwd    = "./.terragrunt-cache/51VQ8cOaCmus2jMgoFkn-vAqiTc/otNjPEaGW-4SZcUM-28oiXiKtfo/aws/common"
14:42:33.011 STDOUT terraform:                   + module = ".terraform/modules/notify_slack_critical.lambda"
14:42:33.011 STDOUT terraform:                   + root   = "."
14:42:33.011 STDOUT terraform:                 }
14:42:33.011 STDOUT terraform:             )
14:42:33.011 STDOUT terraform:           + "recreate_missing_package" = "true"
14:42:33.011 STDOUT terraform:           + "runtime"                  = "python3.11"
14:42:33.011 STDOUT terraform:           + "source_path"              = "\".terraform/modules/notify_slack_critical/functions/notify_slack.py\""
14:42:33.011 STDOUT terraform:         }
14:42:33.011 STDOUT terraform:       + result  = (known after apply)
14:42:33.011 STDOUT terraform:     }
14:42:33.011 STDOUT terraform:   # module.notify_slack_critical.module.lambda.aws_iam_policy.additional_json[0] will be updated in-place
14:42:33.011 STDOUT terraform:   ~ resource "aws_iam_policy" "additional_json" {
14:42:33.011 STDOUT terraform:         id               = "arn:aws:iam::296255494825:policy/lambda-notify-slack-critical"
14:42:33.011 STDOUT terraform:         name             = "lambda-notify-slack-critical"
14:42:33.011 STDOUT terraform:       ~ policy           = jsonencode(
14:42:33.011 STDOUT terraform:             {
14:42:33.013 STDOUT terraform:               - Statement = [
14:42:33.013 STDOUT terraform:                   - {
14:42:33.013 STDOUT terraform:                       - Action   = [
14:42:33.013 STDOUT terraform:                           - "logs:PutLogEvents",
14:42:33.013 STDOUT terraform:                           - "logs:CreateLogStream",
14:42:33.013 STDOUT terraform:                         ]
14:42:33.013 STDOUT terraform:                       - Effect   = "Allow"
14:42:33.013 STDOUT terraform:                       - Resource = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/notify-slack-critical:*"
14:42:33.013 STDOUT terraform:                       - Sid      = "AllowWriteToCloudwatchLogs"
14:42:33.013 STDOUT terraform:                     },
14:42:33.013 STDOUT terraform:                 ]
14:42:33.013 STDOUT terraform:               - Version   = "2012-10-17"
14:42:33.013 STDOUT terraform:             }
14:42:33.013 STDOUT terraform:         ) -> (known after apply)
14:42:33.013 STDOUT terraform:         tags             = {}
14:42:33.013 STDOUT terraform:         # (7 unchanged attributes hidden)
14:42:33.013 STDOUT terraform:     }
14:42:33.013 STDOUT terraform:   # module.notify_slack_critical.module.lambda.aws_iam_role.lambda[0] will be updated in-place
14:42:33.013 STDOUT terraform:   ~ resource "aws_iam_role" "lambda" {
14:42:33.013 STDOUT terraform:       ~ assume_role_policy    = jsonencode(
14:42:33.013 STDOUT terraform:             {
14:42:33.013 STDOUT terraform:               - Statement = [
14:42:33.013 STDOUT terraform:                   - {
14:42:33.013 STDOUT terraform:                       - Action    = "sts:AssumeRole"
14:42:33.013 STDOUT terraform:                       - Effect    = "Allow"
14:42:33.013 STDOUT terraform:                       - Principal = {
14:42:33.013 STDOUT terraform:                           - Service = "lambda.amazonaws.com"
14:42:33.013 STDOUT terraform:                         }
14:42:33.013 STDOUT terraform:                       - Sid       = ""
14:42:33.013 STDOUT terraform:                     },
14:42:33.013 STDOUT terraform:                 ]
14:42:33.013 STDOUT terraform:               - Version   = "2012-10-17"
14:42:33.013 STDOUT terraform:             }
14:42:33.013 STDOUT terraform:         ) -> (known after apply)
14:42:33.013 STDOUT terraform:         id                    = "lambda-notify-slack-critical"
14:42:33.014 STDOUT terraform:         name                  = "lambda-notify-slack-critical"
14:42:33.014 STDOUT terraform:         tags                  = {}
14:42:33.014 STDOUT terraform:         # (11 unchanged attributes hidden)
14:42:33.014 STDOUT terraform:         # (1 unchanged block hidden)
14:42:33.014 STDOUT terraform:     }
14:42:33.014 STDOUT terraform:   # module.notify_slack_critical.module.lambda.aws_lambda_function.this[0] will be updated in-place
14:42:33.014 STDOUT terraform:   ~ resource "aws_lambda_function" "this" {
14:42:33.014 STDOUT terraform:       ~ filename                       = "builds/1e622be40890679d302c03a6096c334d64151aab5aee3e073035598ee5e01db2.zip" -> (known after apply)
14:42:33.014 STDOUT terraform:         id                             = "notify-slack-critical"
14:42:33.014 STDOUT terraform:   ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.cloudwatch_data_scanned"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.notify_global"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
